Revit 2027 API
BuiltInFailures.DesignOptionFailures.FabricationCannotBeInDesignOption Property
 Structural steel connections or individual structural steel fabrication elements are not allowed in Design Options.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricationCannotBeInDesignOption { get; }
Public Shared ReadOnly Property FabricationCannotBeInDesignOption As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricationCannotBeInDesignOption {
	FailureDefinitionId^ get ();
}
static member FabricationCannotBeInDesignOption : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace